/*:
 ## Упражнение 1 — константы
 
 Определите константу с именем «friends», содержащую количество друзей, которое у вас имеется в социальных сетях. Дайте ей значение от 50 до 1000. Напечатайте это значение, используя определённую вами константу.
 */
let friends = 152
print(friends)
/*:
 Теперь представьте, что вы прошлись по вашему списку друзей и удалили тех, что неактивны в социальных сетях. Обновите вашу константу «friends» таким образом, чтобы она содержала новое (меньшее) количество друзей.
 */

/*:
 Компилируется ли новый код? Почему? Напишите ваш ответ в консоли, используя функцию «print». Вернитесь и удалите строку кода, в которой константе «friends» присваивается меньшее значение, чтобы код скомпилировался. Разместите результат в Seesaw.
 */
print("Новый код не компилируеся, потому что значение константы не переприсваивается")
//: страница 1 из 10  |  [Далее: Упражнение 2 для приложения - Целевое число шагов](@next)
